{
  "random": [
    { "id": 1, "title": "Did you know the Sun is over 300,000 times larger than Earth?" },
    { "id": 2, "title": "Did you know Venus is the hottest planet, with temperatures over 450°C?" },
    { "id": 3, "title": "Did you know a year on Mercury is just 88 days long?" },
    {
      "id": 4,
      "title": "Did you know Mars is known as the Red Planet because of its reddish appearance, caused by iron rust?"
    },
    { "id": 5, "title": "Did you know Jupiter is the largest planet in our solar system?" },
    {
      "id": 6,
      "title": "Did you know Saturn has the most spectacular rings, made from ice and rock?"
    },
    { "id": 7, "title": "Did you know Uranus rotates on its side, unlike any other planet?" },
    {
      "id": 8,
      "title": "Did you know Neptune was the first planet discovered through mathematical predictions?"
    },
    {
      "id": 9,
      "title": "Did you know Pluto, now classified as a dwarf planet, was once considered the ninth planet?"
    },
    {
      "id": 10,
      "title": "Did you know the Milky Way galaxy is estimated to be 100,000 light years in diameter?"
    },
    {
      "id": 11,
      "title": "Did you know stars are gigantic balls of gas held together by gravity, with the closest to Earth being the Sun?"
    },
    {
      "id": 12,
      "title": "Did you know the Moon is Earth’s only natural satellite and affects tides on our planet?"
    },
    {
      "id": 13,
      "title": "Did you know a solar eclipse occurs when the Moon passes between Earth and the Sun?"
    },
    {
      "id": 14,
      "title": "Did you know a light year is the distance light travels in one year, about 9 trillion kilometers?"
    },
    {
      "id": 15,
      "title": "Did you know the universe is believed to be about 13.8 billion years old?"
    },
    {
      "id": 16,
      "title": "Did you know astronauts experience microgravity, making them feel weightless in space?"
    },
    {
      "id": 17,
      "title": "Did you know there are more stars in the universe than grains of sand on all the Earth's beaches?"
    },
    {
      "id": 18,
      "title": "Did you know the first person to walk on the Moon was Neil Armstrong in 1969?"
    },
    {
      "id": 19,
      "title": "Did you know a day on Venus is longer than its year, taking 243 Earth days to rotate once?"
    },
    {
      "id": 20,
      "title": "Did you know the largest volcano in the solar system is on Mars, named Olympus Mons?"
    },
    {
      "id": 21,
      "title": "Did you know the asteroid belt lies between Mars and Jupiter, containing millions of rocky objects?"
    },
    {
      "id": 22,
      "title": "Did you know the Hubble Space Telescope orbits Earth, capturing stunning images of space?"
    },
    {
      "id": 23,
      "title": "Did you know black holes have such strong gravity that not even light can escape from them?"
    },
    {
      "id": 24,
      "title": "Did you know Saturn could float in water because it's mostly made of gas?"
    },
    {
      "id": 25,
      "title": "Did you know the first animal sent into space was a dog named Laika by the Soviet Union in 1957?"
    }
  ]
}
